# GetTextStyleRef

## Description
Function GetTextStyleRef returns the text style for the referenced object. The integer returned is the internal index of the text style used by this object. <BR>
<BR>
If the text object is using class text style, this returns the effective style.  You should use the *TextStyleByClass* functions to check and preserve by-class behavior.

```pascal
FUNCTION GetTextStyleRef(objectId : HANDLE): LONGINT;
```

```python
def vs.GetTextStyleRef(objectId):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectId|HANDLE|handle to object|

## Examples
```pascal
resultN := GetTextStyleRef(objectId);
```
```python
import vs

# Function GetTextStyleRef returns the text style for the referenced object.
objectId = vs.FSActLayer()  # handle to the first selected object on the active layer

resultN = vs.GetTextStyleRef(objectId)
vs.Message('GetTextStyleRef returned: ' + str(resultN))
```

## See Also
VS Functions:
SetTextStyleRef
| GetTextStyleRef
| SetTextStyleRefN
| GetTextStyleRefN
| SetTextStyleByClass
| SetTextStyleByClassN
| IsTextStyleByClass
| IsTextStyleByClassN

## Version
Availability: from Vectorworks 2015

## Category
* Objects - Text